package com.academy.lesson03;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.io.Reader;

public class CountOfSubStrings {
    /*    3) Напишите программу, которая:
        - считывает строку
        - считывает подстроку
        - выводит исходные строку и подстроку и выводит кол-во вхождений строки в подстроку*/

    public static void countOfStrings() {
        System.out.println("=============================================================================");
        System.out.println("The program counts the numbers of congruences:");
        Reader r = new InputStreamReader(System.in);
        BufferedReader reader = new BufferedReader(r);


    }
}
